# Шифрования RSA методом бесключевого чтения

# N = 357114156277
# e1 = 1025537
# e2 = 722983
# C1 = [
#     68639736967
# ]
# C2 = [
#     204258645263
# ]

N = 392117053283
e1 = 744721 
e2 = 1297633
C1 = [
    188779427301,
    142624237358,
    222856552604,
    64779987640,
    184552630472,
    357891671735,
    159800573947,
    320365191568,
    53704108470,
    29809614757,
    236651896578,
    5185872557,
    374026260505,
]
C2 = [330155414629,
    183843269790,
    113231290101,
    381735803560,
    115846890704,
    117837936469,
    188064551177,
    241636957582,
    253908524873,
    219235963059,
    333424804843,
    278400905892,
    254102728294,
]

print("Входные данные:")
print(f'N = {N}')
print(f'e1 = {e1}')
print(f'e2 = {e2}')
print(f'C1 = {C1}')
print(f'C2 = {C2}\n')

def Euclid(e1, e2):
    if e2 == 0:
        return 1, 0
    else:
        r1, s1 = Euclid(e2, e1 % e2)
        r = s1
        s = r1 - (e1 // e2) * s1
        return r, s 

r,s = Euclid(e1,e2)

print("Основные показатели:")
print(f'r = {r}')
print(f's = {s}\n')

text = ''
i=0

print("Расшифровка шифроблоков:\n")
for j in range (0,len(C1)-1):
    i+=1
    x = pow(C1[j],r,N) * pow(C2[j],s,N) % N
    code = x.to_bytes(4,'big')
    block = code.decode('cp1251') # другой не декодит
    text += block 
    if i<=3:
        print(f"Промежуточные вычисления блока № {i}:")
        print(f'C1^r = {pow(C1[j],r,N)}')
        print(f'C2^s = {pow(C2[j],s,N)}')
        print(f'm^(e1*r-e2*s) = {pow(C1[j],r,N) * pow(C2[j],s,N)}')
        print(f'm^(e1*r-e2*s) mod N = {x}')
    print(f'block{i} : {block}\n')
print('\n')

print("Полностью расшифрованный текст:")
print(text)