
-- 1 запрос
select Н_ЛЮДИ.ФАМИЛИЯ, Н_ВЕДОМОСТИ.ИД from Н_ЛЮДИ 
join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
where Н_ЛЮДИ.ФАМИЛИЯ = 'Иванов' and
Н_ВЕДОМОСТИ.ЧЛВК_ИД = 163249 and
Н_ВЕДОМОСТИ.ЧЛВК_ИД = 163249;

-- 1 планы
select count(*) from Н_ЛЮДИ;

select count(*) from Н_ВЕДОМОСТИ;

select count(*) from Н_ЛЮДИ where ФАМИЛИЯ = 'Иванов';

select count(*) from Н_ВЕДОМОСТИ where ЧЛВК_ИД = 163249;

select count(*) from Н_ЛЮДИ join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД;

-- 1 explain analyze
explain analyze select Н_ЛЮДИ.ФАМИЛИЯ, Н_ВЕДОМОСТИ.ИД from Н_ЛЮДИ 
join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
where Н_ЛЮДИ.ФАМИЛИЯ = 'Иванов' and
Н_ВЕДОМОСТИ.ЧЛВК_ИД = 163249 and
Н_ВЕДОМОСТИ.ЧЛВК_ИД = 163249;



-- 2 запрос
select Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ДАТА from Н_ЛЮДИ 
left join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
left join Н_СЕССИЯ on Н_ЛЮДИ.ИД=Н_СЕССИЯ.ЧЛВК_ИД
where  Н_ЛЮДИ.ФАМИЛИЯ = 'Соколов' and
Н_ВЕДОМОСТИ.ЧЛВК_ИД < 142390;

-- 2 планы
select count(*) from Н_ЛЮДИ;

select count(*) from Н_ВЕДОМОСТИ;

select count(*) from Н_СЕССИЯ;

select count(*) from Н_ЛЮДИ where ФАМИЛИЯ = 'Соколов';

select count(*) from Н_ВЕДОМОСТИ where ЧЛВК_ИД < 142390;

select count(*) from Н_ЛЮДИ left join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД 
left join Н_СЕССИЯ on Н_ЛЮДИ.ИД=Н_СЕССИЯ.ЧЛВК_ИД;

select count(*) from Н_ЛЮДИ left join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД 
where  Н_ЛЮДИ.ФАМИЛИЯ = 'Соколов' and Н_ВЕДОМОСТИ.ЧЛВК_ИД < 142390;

-- 2 explain analyze
explain analyze select Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.ДАТА from Н_ЛЮДИ 
left join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
left join Н_СЕССИЯ on Н_ЛЮДИ.ИД=Н_СЕССИЯ.ЧЛВК_ИД
where  Н_ЛЮДИ.ФАМИЛИЯ = 'Соколов' and
Н_ВЕДОМОСТИ.ЧЛВК_ИД < 142390;