-- номер 1
select "Н_ЛЮДИ"."ИД" as "Id ученика", "Н_ВЕДОМОСТИ"."ДАТА" as "Дата заполнения ведомости"
from "Н_ЛЮДИ"
    inner join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
where "Н_ЛЮДИ"."ОТЧЕСТВО" < 'Сергеевич'
and "Н_ВЕДОМОСТИ"."ДАТА" < '1998-01-05'
and "Н_ВЕДОМОСТИ"."ДАТА" < '2022-06-08';

-- номер 2
select "Н_ЛЮДИ"."ИД", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."НАЧАЛО"
from "Н_ЛЮДИ"
    left join "Н_ОБУЧЕНИЯ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    left join "Н_УЧЕНИКИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
where "Н_ЛЮДИ"."ФАМИЛИЯ" = 'Петров'
and "Н_ОБУЧЕНИЯ"."НЗК"::int < 933232;

-- номер 3
select count(*)
from "Н_УЧЕНИКИ" 
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"        
    join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = "Н_ПЛАНЫ"."ФО_ИД"
    join "Н_ОБУЧЕНИЯ" on "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    where "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" like '%вечерняя%'
    and "Н_ЛЮДИ"."ОТЧЕСТВО" = '.';

-- номер 4
select "Н_ЛЮДИ"."ФАМИЛИЯ", count(*) as "КОЛИЧЕСТВО" from "Н_ЛЮДИ" 
join "Н_УЧЕНИКИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" and "Н_ЛЮДИ"."ФАМИЛИЯ" not like ' ' and "Н_ЛЮДИ"."ФАМИЛИЯ" not like '.'
join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
join "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД" and "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
group by "ФАМИЛИЯ" having "Н_ЛЮДИ"."ФАМИЛИЯ" = 
(SELECT Н_ЛЮДИ.ФАМИЛИЯ from Н_ЛЮДИ 
WHERE NOT EXISTS (SELECT 1 from Н_УЧЕНИКИ 
where Н_УЧЕНИКИ.ЧЛВК_ИД=Н_ЛЮДИ.ИД))
and COUNT(*) >2;



SELECT Н_ЛЮДИ.ФАМИЛИЯ, count(*) as "КОЛИЧЕСТВО" from Н_ЛЮДИ 
WHERE NOT EXISTS (SELECT 1 from Н_УЧЕНИКИ where Н_УЧЕНИКИ.ЧЛВК_ИД=Н_ЛЮДИ.ИД)
group by ФАМИЛИЯ having COUNT(*) < 50 ;

-- номер 5
select "Н_УЧЕНИКИ"."ЧЛВК_ИД", 
        "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ",
        "Н_ЛЮДИ"."ОТЧЕСТВО",
        avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as decimal)) as "Средняя оценка"
from "Н_УЧЕНИКИ"
    join "Н_ОБУЧЕНИЯ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
        where "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$'
            and "Н_УЧЕНИКИ"."ГРУППА" = '4100'
    group by ("Н_УЧЕНИКИ"."ЧЛВК_ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ","Н_ЛЮДИ"."ОТЧЕСТВО")
        having avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as decimal)) >= 
(select cast(min("Н_ВЕДОМОСТИ"."ОЦЕНКА") as decimal)
from "Н_ВЕДОМОСТИ"
    join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    join "Н_ОБУЧЕНИЯ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    join "Н_УЧЕНИКИ" on "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
        where "ГРУППА" = '1101'
            and "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$');

-- номер 6
-- объединение таблиц
select "Н_УЧЕНИКИ"."ГРУППА",
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
from "Н_УЧЕНИКИ"
    join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
    join "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" on "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
    join "Н_НАПР_СПЕЦ" on "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = "Н_НАПР_СПЕЦ"."ИД"
        where "Н_УЧЕНИКИ"."НАЧАЛО" = '2012-09-01 00:00:00.000000'
            and "Н_ПЛАНЫ"."КУРС" = '1'
            and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
            and "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия';

-- с подзапросами
select "Н_УЧЕНИКИ"."ГРУППА",
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "Н_УЧЕНИКИ"."П_ПРКОК_ИД"
from "Н_УЧЕНИКИ"
    join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
        where exists(select * from "Н_ФОРМЫ_ОБУЧЕНИЯ" where "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная')
        and exists(select * from "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" join "Н_НАПР_СПЕЦ" on "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = "Н_НАПР_СПЕЦ"."ИД" 
            where "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД" and "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия')
        and "Н_УЧЕНИКИ"."НАЧАЛО" = '2012-09-01 00:00:00.000000'
        and "Н_ПЛАНЫ"."КУРС" = '1';


-- номер 7
select 
	COUNT("Н_ЛЮДИ"."ИД")
from "Н_ЛЮДИ"
join "Н_УЧЕНИКИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
join "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД" 
where "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ' 
	and "Н_ЛЮДИ"."ИД" not in (
		select
			"Н_ЛЮДИ"."ИД"
		from "Н_ЛЮДИ"
		join "Н_ВЕДОМОСТИ" on 
"Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
		where "Н_ВЕДОМОСТИ"."ОЦЕНКА" in ('2', '3', 'незач', 'неявка')
	);
